; domain
(define (domain emergency-services)
  (:requirements :strips :typing)
  (:types 
    location person drone crate content arm
  ) 

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)
    (hand-empty ?d - drone ?a - arm)
    (holding ?d - drone ?a - arm ?c - crate)
    (crate-content ?c - crate ?cnt - content)
    (has-content ?p - person ?cnt - content)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition (at-drone ?d ?from)
    :effect (and (not (at-drone ?d ?from)) (at-drone ?d ?to))
  )

  (:action pick-up
    :parameters (?d - drone ?a - arm ?c - crate ?l - location)
    :precondition (and (at-drone ?d ?l) (at-crate ?c ?l) (hand-empty ?d ?a))
    :effect (and (not (at-crate ?c ?l)) (not (hand-empty ?d ?a)) (holding ?d ?a ?c))
  )

  (:action deliver
    :parameters (?d - drone ?a - arm ?c - crate ?p - person ?l - location ?cnt - content)
    :precondition (and (at-drone ?d ?l) (at-person ?p ?l) (holding ?d ?a ?c) (crate-content ?c ?cnt))
    :effect (and (not (holding ?d ?a ?c)) (hand-empty ?d ?a) (has-content ?p ?cnt))
  )
)

; problem
(define (problem problem_d1_r0_l6_p6_c6_g6)
  (:domain emergency-services)
  (:objects
    drone1 - drone
    depot - location
    loc1 - location
    loc2 - location
    loc3 - location
    loc4 - location
    loc5 - location
    loc6 - location
    person1 - person
    person2 - person
    person3 - person
    person4 - person
    person5 - person
    person6 - person
    crate1 - crate
    crate2 - crate
    crate3 - crate
    crate4 - crate
    crate5 - crate
    crate6 - crate
    food - content
    medicine - content
    left - arm
    right - arm
  )
  (:init
    (at-drone drone1 depot)
    (hand-empty drone1 left)
    (hand-empty drone1 right)
    (at-crate crate1 depot)
    (at-crate crate2 depot)
    (at-crate crate3 depot)
    (at-crate crate4 depot)
    (at-crate crate5 depot)
    (at-crate crate6 depot)
    (at-person person1 loc1)
    (at-person person2 loc4)
    (at-person person3 loc6)
    (at-person person4 loc1)
    (at-person person5 loc6)
    (at-person person6 loc3)
    (crate-content crate1 food)
    (crate-content crate2 food)
    (crate-content crate3 food)
    (crate-content crate4 food)
    (crate-content crate5 food)
    (crate-content crate6 medicine)
  )
  (:goal (and
    (has-content person1 food)
    (has-content person2 food)
    (has-content person3 food)
    (has-content person4 medicine)
    (has-content person5 food)
    (has-content person6 food)
  ))
)

; plan
1. (pick-up drone1 left crate5 depot)
   deleted: (at-crate crate5 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate5)
   goals met: 0 of 6
2. (pick-up drone1 right crate6 depot)
   deleted: (at-crate crate6 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate6)
   goals met: 0 of 6
3. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 0 of 6
4. (deliver drone1 right crate6 person4 loc1 medicine)
   deleted: (holding drone1 right crate6)
   added: (hand-empty drone1 right) (has-content person4 medicine)
   goals met: 1 of 6
5. (deliver drone1 left crate5 person1 loc1 food)
   deleted: (holding drone1 left crate5)
   added: (hand-empty drone1 left) (has-content person1 food)
   goals met: 2 of 6
6. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 2 of 6
7. (pick-up drone1 left crate2 depot)
   deleted: (at-crate crate2 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate2)
   goals met: 2 of 6
8. (pick-up drone1 right crate1 depot)
   deleted: (at-crate crate1 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate1)
   goals met: 2 of 6
9. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 2 of 6
10. (deliver drone1 left crate2 person2 loc4 food)
   deleted: (holding drone1 left crate2)
   added: (hand-empty drone1 left) (has-content person2 food)
   goals met: 3 of 6
11. (fly drone1 loc4 loc3)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 loc3)
   goals met: 3 of 6
12. (deliver drone1 right crate1 person6 loc3 food)
   deleted: (holding drone1 right crate1)
   added: (hand-empty drone1 right) (has-content person6 food)
   goals met: 4 of 6
13. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 4 of 6
14. (pick-up drone1 left crate3 depot)
   deleted: (at-crate crate3 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate3)
   goals met: 4 of 6
15. (pick-up drone1 right crate4 depot)
   deleted: (at-crate crate4 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate4)
   goals met: 4 of 6
16. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 4 of 6
17. (deliver drone1 left crate3 person3 loc6 food)
   deleted: (holding drone1 left crate3)
   added: (hand-empty drone1 left) (has-content person3 food)
   goals met: 5 of 6
18. (deliver drone1 right crate4 person5 loc6 food)
   deleted: (holding drone1 right crate4)
   added: (hand-empty drone1 right) (has-content person5 food)
   goals met: 6 of 6
